# Вариант 6
# Задание 2
# Дано целое число N(>0). Использую операции деления нацело и взятия остатка от деления,
# вывести все его цифры, начиная с самой правой (разряд единиц).
# Ввод целого числа
n = input("Введите целое число N: ")
# Проверяем правильность ввода числа N
while type(n) != int:
    try:
        n = int(n) # Преобразуем строку в целое число
    except ValueError:
        print("Неправильно ввели! ")
        n = input("Введите целое число N: ")
# Проверяем, что число больше нуля
while n <= 0:
    print("Число должно быть больше нуля! ")
    n = int(input("Введите целое число N: "))
# Выводим цифры числа справа налево
while n > 0:
    c = n % 10 # Получаем последнюю цифру числа
    print(c) # Выводим найденную цифру
    n = n // 10 # Удаляем последнюю цифру числа