# Вариант6
# Задание 1
# Даны два целых числа A и B (A < B). Найти сумму всех целых чисел от A до B включительно.
# Ввод двух целых чисел А и В
a = input("Введите первое число А: ")
b = input("Введите второе число В: ")
# Проверка правильного ввода числа А
while type(a) != int:
    try:
        a = int(a) # Преобразуем строку в целое число
    except ValueError:
        print("Неправильно ввели! ")
        a = input("Введите превое число А: ")
# Проверка правильного ввода числа В
while type(b) != int:
    try:
        b = int(b) # Преобразуем строку в целое число
    except ValueError:
        print("Неправильно ввели! ")
        b = input("Введите второе число: ")
# Проверяем условие А < В
while a >=b:
    print("А должно быть меньше В!")
    a = int(input("Введите первое число А: "))
    b = int(input("Введите второе число В: "))
# Начальная сумма равна нулю
s = 0
# Складываем все числа от А до В включительно
while a <= b:
    s += a # Добавляем текущее число к сумме
    a += 1 # Переходим к следующему числу
# Ввыводим результат
print("Сумма чисел:", s)